logo ="""     ╔══━━══━━══━━══━━══━━┓
     ┃░█▀▀░█▀█░█▀▄░█▀▄░█░░┃
     ┃░█░░░█░█░█░█░█▀▄░█░░┃
     ┃░▀▀▀░▀░▀░▀▀░░▀▀░░▀▀▀┃
     ┗══━━══━━══━━══━━══━━┛
"""

bl_all_db_header = '''╔══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━┓
┃░█▀█░█░░░█░░░░░█▀▄░█▀█░▀█▀░█▀█░█▀▄░█▀█░█▀▀░█▀▀░█▀▀░┃
┃░█▀█░█░░░█░░░░░█░█░█▀█░░█░░█▀█░█▀▄░█▀█░▀▀█░█▀▀░▀▀█░┃
┃░▀░▀░▀▀▀░▀▀▀░░░▀▀░░▀░▀░░▀░░▀░▀░▀▀░░▀░▀░▀▀▀░▀▀▀░▀▀▀░┃
┗══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━┛
╔═━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══
┃!!NOTE!!
┃the sqlite databases consist of:
┃1. a file with a ".db" postfix
┃2. inside the file are tables
┃-(think of tables like an excel sheet, they store data in a similar manner)
┃3. inside the tables are variables which hold a certain data type
┃░░HELP░░
┃to see the basics of how to store data, refer to:
┃https://github.com/DrDoofinshmekel/Chucklenuts_DBL-sqlite3
┃
┃press [ENTER] to return to menu
┗═━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══
'''

bl_terminal_manager = """╔══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━═┓
┃░▀█▀░█▀▀░█▀▄░█▄█░▀█▀░█▀█░█▀█░█░░░░░█▄░▄█░█▀█░█▀█░█▀█░█▀▀░█▀▀░█▀▄░┃
┃░░█░░█▀▀░█▀▄░█░█░░█░░█░█░█▀█░█░░░░░█░▀░█░█▀█░█░█░█▀█░█░█░█▀▀░█▀▄░┃
┃░░▀░░▀▀▀░▀░▀░▀░▀░▀▀▀░▀░▀░▀░▀░▀▀▀░░░▀░░░▀░▀░▀░▀░▀░▀░▀░▀▀▀░▀▀▀░▀░▀░┃
┗══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━═┛
╔━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━
┃ENTER the number of the database or you would like to navigate to.
┃
┃ENTER "<<<" to exit toolkit
┗━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━
"""

bl_db_terminal = """╔━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══┓
┃░█▀▄░█▀▄░░░▀█▀░█▀▀░█▀▄░█▄█░▀█▀░█▀█░█▀█░█░░░┃
┃░█░█░█▀▄░░░░█░░█▀▀░█▀▄░█░█░░█░░█░█░█▀█░█░░░┃
┃░▀▀░░▀▀░░░░░▀░░▀▀▀░▀░▀░▀░▀░▀▀▀░▀░▀░▀░▀░▀▀▀░┃
┗━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══┛
 ╔━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━
 ┃ENTER the number of the action you want to do in the database
 ┃
 ┃ENTER "<<<" to go back
 ┗━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━
"""
bl_criteria_search_db = '''
╔━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━┓
┃░█▀▀░█▀▄░▀█▀░▀█▀░█▀▀░█▀▄░▀█▀░█▀█░░░█▀▄░█▀█░▀█▀░█▀█░█▀▄░█▀█░█▀▀░█▀▀░░░█▀▀░█▀▀░█▀█░█▀▄░█▀▀░█░█░┃
┃░█░░░█▀▄░░█░░░█░░█▀▀░█▀▄░░█░░█▀█░░░█░█░█▀█░░█░░█▀█░█▀▄░█▀█░▀▀█░█▀▀░░░▀▀█░█▀▀░█▀█░█▀▄░█░░░█▀█░┃
┃░▀▀▀░▀░▀░▀▀▀░░▀░░▀▀▀░▀░▀░▀▀▀░▀░▀░░░▀▀░░▀░▀░░▀░░▀░▀░▀▀░░▀░▀░▀▀▀░▀▀▀░░░▀▀▀░▀▀▀░▀░▀░▀░▀░▀▀▀░▀░▀░┃
┗━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━┛
╔━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━
┃[ENTER] the index of the table(s) you want to include in your search
┃[ENTER] the index of the variable(s) you want to include in your search
┃[ENTER] "<lim" to set a limit on results to be returned
┃[ENTER] "<q" to set the search term/words
█━══━━━█
┃[ENTER] "<" to search for results
┃[ENTER] "<write" to submit the query and write the results to a text file
┗━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━
'''
dbs_sel_header = '''
╔━══━━══━━══━━══━━══━━══━━══━━══━━══━━┓
┃░█▀▄░█▀█░▀█▀░█▀█░█▀▄░█▀█░█▀▀░█▀▀░█▀▀░┃
┃░█░█░█▀█░░█░░█▀█░█▀▄░█▀█░▀▀█░█▀▀░▀▀█░┃
┃░▀▀░░▀░▀░░▀░░▀░▀░▀▀░░▀░▀░▀▀▀░▀▀▀░▀▀▀░┃
┗━══━━══━━══━━══━━══━━══━━══━━══━━══━━┛
 ╔━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━
 ┃[ENTER] a number to select or deselect the databases you want to search
 ┃[ENTER] "<r" to reset the selected databases
 ┃[ENTER] "<a" to select all the databases
 ┃
 ┃[ENTER] "<" to continue to the search page
 ┗━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━

'''

# True or False will appear as these graphics in the program
t_f_standins = {True: '🗸',
                False: '☓'}

bl_search_db = """╔━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━┓
┃░█▀▀░▄▀▄░█░░░░░█▀▄░█▀█░▀█▀░█▀█░█▀▄░█▀█░█▀▀░█▀▀░░░█▀▀░█▀▀░█▀█░█▀▄░█▀▀░█░█░┃
┃░▀▀█░█░█░█░░░░░█░█░█▀█░░█░░█▀█░█▀▄░█▀█░▀▀█░█▀▀░░░▀▀█░█▀▀░█▀█░█▀▄░█░░░█▀█░┃
┃░▀▀▀░░▀▄░▀▀▀░░░▀▀░░▀░▀░░▀░░▀░▀░▀▀░░▀░▀░▀▀▀░▀▀▀░░░▀▀▀░▀▀▀░▀░▀░▀░▀░▀▀▀░▀░▀░┃
┗━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━┛
╔━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━
┃[ENTER] SQL commands to add to the command queue for searching a database
┃
┃[ENTER] "<sel" to select a different database to search
┃[ENTER] "<" to execute all queued commands and print results
┃[ENTER] "<write" to execute all queued commands, print, and write results to a file
┃[ENTER] "<<<" to go back
┗━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━"""

bl_cmd_queue = """        ╔━══━━══━━══━━══━━══━━══━━══━━══━━══━┓
        ┃▄▀▀ █▄ ▄█ █▀▄   ▄▀█ █ █ ██▀ █ █ ██▀ █════┓
        ┃▀▄▄ █ ▀ █ █▄▀   ▀▄█ ▀▄█ █▄▄ ▀▄█ █▄▄ |    █════┓
        ┃                   ▀                |         ┃
        █━══━━══━━══━━══━━══━━══━━══━━══━━══━█═════════┛""" 

bl_cmd_queue_footer = """        █━══━━══━━══━━══━━══━━══━━══━━══━━══━█═════════┓
        ┃----DELETION COMMANDS REFERENCE-----|         ┃
        ┃ENTER "<<" to delete last entry     |         ┃
        ┃ENTER "<del" to del a spec command  |    █════┛
        ┃ENTER "<clear" to clear the queue   █════┛
        ┗━══━━══━━══━━══━━══━━══━━══━━══━━══━┛"""
# -SMALL GRAPHICS
# how many database items are seen in the preview window in the toolbox window
db_preview_length = 5
preview_page_footer = '══━━showing 0-5━━══'
queue_prefix = '        ┃'

"""
'<' executes all commands in the queue
'<out' executes all commands in the queue and writes the output to a text file in the server directory
'<<' deletes the last command added to the queue
'<del' delete a specific queued command
'<clear' clear the queue
'<q' quit the virtual terminal
"""

queue_slice = '''
┃░░░░░░ please enter the number of the command you ░░░░░░┃
┃░░░░░░ want to delete, [enter] "<<<" to return    ░░░░░░┃'''
select_db_menu = '''
┃░░░░░░ please enter the number of the database you ░░░░░░┃
┃░░░░░░ want to select, this can be changed later   ░░░░░░┃'''
select_db_fail = '┃░░░░░░the input you entered is not associated with a database░░░░░░┃'


# -MICRO COMPONENTS
line1 = '━══━'
line2 = '═━━═'
upcorn_line = '┗'
downcorn_line = '╔'
fat_rec = '█'
queue_item_pref = ('	' + '┃*')

# boxify components
# top or bottom lenth are generated and are set to be longer by one unit that the message.
bottom_right_corner = '┛'
top_right_corner = '┓'
bottom_left_corner = '┗'
top_left_corner = '╔'
left_wall = '┃'
right_wall = '┃'
# can be different lenth than 4, any lenth works vv
bottom = '━══━'
top = '━══━'

# DB VISUAL GENERATOR GRAPHICS VV
# prefix is placed at the start of the line before the object, headers are placed
# in the line before a new object type starts, an intro to what is next

# every variable is printed on a new line  vv
db_header = '''┃═━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━┓
┃░░░░░░░░░░░░░░░░░░░░█▀▄░█▄▄░░░░░░░░░░░░░░░░░░░░┃
┃░░░░░░░░░░░░░░░░░░░░█▄▀░█▄█░░░░░░░░░░░░░░░░░░░░┃
┃═━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━┃'''

alt_db_header = '''╔═━━══━━══━━══━━══━━══━━┓
┃░░░░░░░DATABASES░░░░░░░┃
┗═━━══━━══━━══━━══━━══━━┛'''

db_prefix = '┃░░CURRENT DB░░┃'

table_header = '''╔═━━══━━══━━══━━══━━══━━══━━══┃
┃░░░░░░░DATABASE TABLES░░░░░░░┃
┗═━━══━━══━━══━━══━━══━━══━━══┃'''

table_prefix = '''\n╔═════════TABLE═════════┓\n┃'''

opt_table_postfix = '''\n┗══━━══━━══━━══━━══━━══━┛'''

var_types_header = '''┃══━━══━━══━━══━━══━━══━┃
┃VARIABLES:             ┃
┃    ╔VARIABLE DATATYPE:┃
┗══━━══━━══━━══━━══━━══━┛'''

var_prefix = '┗'

types_prefix = '┃    ┗'

# DB VISUAL GENERATOR GRAPHICS ^^

toolkit_main_menu = f'''╔━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━═━━┓
┃░▀█▀░█▀█░█▀█░█░░░█▀▄░█▀█░█░█░░█▄░▄█░█▀█░▀█▀░█▀█░░░█▄░▄█░█▀▀░█▀█░█░█░┃
┃░░█░░█░█░█░█░█░░░█▀▄░█░█░▄▀▄░░█░▀░█░█▀█░░█░░█░█░░░█░▀░█░█▀▀░█░█░█░█░┃
┃░░▀░░▀▀▀░▀▀▀░▀▀▀░▀▀░░▀▀▀░▀░▀░░▀░░░▀░▀░▀░▀▀▀░▀░▀░░░▀░░░▀░▀▀▀░▀░▀░▀▀▀░┃
┗━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━═━━┛
 ╔━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━
 ┃ENTER:
 ┃-a number to choose a task
 ┃-"<<<" to exit
 ┗━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━━══━
┃░░OPTIONS░░┃
1. search databases
2. view databases
3. edit databases
4. dependencies check
5. version information'''

# SEARCH RESULTS vv
results_header = '''░░░SEARCH░░RESULTS░░░'''

query_header = '''\n┃░░QUERY░░┃'''
inline_list_footer = '\n██results██'
# SEARCH RESULTS ^^

# INLINE LIST FORMAT vv
inline_separator = '┃ '
# INLINE LIST FORMAT ^^
